In [7]:
import csv
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from pandasql import sqldf
import plotly.express as px

In [8]:

dataset = pd.read_csv("./dataset/student-por.csv",sep=";")
mathset = pd.read_csv("./dataset/student-mat.csv",sep=";")
mathset.head()
dataset["M1"] = mathset["G1"]
dataset["M2"] = mathset["G2"]
dataset["M3"] = mathset["G3"]
dataset["MPaid"] = mathset["paid"]
dataset.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,Walc,health,absences,G1,G2,G3,M1,M2,M3,MPaid
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,1,3,4,0,11,11,5.0,6.0,6.0,no
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,1,3,2,9,11,11,5.0,5.0,6.0,no
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,3,3,6,12,13,12,7.0,8.0,10.0,yes
3,GP,F,15,U,GT3,T,4,2,health,services,...,1,5,0,14,14,14,15.0,14.0,15.0,yes
4,GP,F,16,U,GT3,T,3,3,other,other,...,2,5,0,11,13,13,6.0,10.0,10.0,yes

In [9]:
def convertToNumeric(column : pd.DataFrame, attributes : list[str]):
    for i in range(column.size):
        for k in range(len(attributes)):
            if attributes[k] == column[i]:
                column[i] = k
                pass
            pass
        pass
    pass

In [12]:
numeric = dataset.copy()
convertToNumeric(numeric["school"], ["GP","MS"])
convertToNumeric(numeric["sex"], ["F","M"])
convertToNumeric(numeric["address"], ["U","R"])
convertToNumeric(numeric["famsize"], ["LE3","GT3"])
convertToNumeric(numeric["Pstatus"], ["A","T"])
convertToNumeric(numeric["Mjob"],["teacher","health","services","at_home"])
convertToNumeric(numeric["Fjob"],["teacher","health","services","at_home"])
convertToNumeric(numeric["reason"],["home","reputation","course","other"])

numeric.head()

/tmp/ipykernel_7957/3725644536.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  column[i] = k

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,Walc,health,absences,G1,G2,G3,M1,M2,M3,MPaid
0,0,0,18,0,1,A,4,4,at_home,teacher,...,1,3,4,0,11,11,5.0,6.0,6.0,no
1,0,0,17,0,1,T,1,1,at_home,other,...,1,3,2,9,11,11,5.0,5.0,6.0,no
2,0,0,15,0,0,T,1,1,at_home,other,...,3,3,6,12,13,12,7.0,8.0,10.0,yes
3,0,0,15,0,1,T,4,2,health,services,...,1,5,0,14,14,14,15.0,14.0,15.0,yes
4,0,0,16,0,1,T,3,3,other,other,...,2,5,0,11,13,13,6.0,10.0,10.0,yes

In [25]:
dataset.tail()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
644,MS,F,19,R,GT3,T,2,3,services,other,...,5,4,2,1,2,5,4,10,11,10
645,MS,F,18,U,LE3,T,3,1,teacher,services,...,4,3,4,1,1,1,4,15,15,16
646,MS,F,18,U,GT3,T,1,1,other,other,...,1,1,1,1,1,5,6,11,12,9
647,MS,M,17,U,LE3,T,3,1,services,services,...,2,4,5,3,4,2,6,10,10,10
648,MS,M,18,R,LE3,T,3,2,services,other,...,4,4,1,3,4,5,4,10,11,11